Revit 2024 API
FabricationItemFile Methods
The FabricationItemFile type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetImage
Gets the image for the fabrication item file.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsLoaded
 Checks to see if the item file has been loaded into the configuration.
IsValid
 Checks to see if the item file is valid.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FabricationItemFile Class
Autodesk.Revit.DB Namespace